package main

import "fmt"

func main() {
	// 生命一个变量 保存接收用户输入的选项
	key := ""
	// 声明一个变量 控制是否退出for循环
	loop := true

	// 显示这个主菜单
	for {
		fmt.Println("--------------------------记账软件--------------------------")
		fmt.Println("------------------------1、收支明细--------------------------")
		fmt.Println("------------------------2、登记收入--------------------------")
		fmt.Println("------------------------3、登记支出--------------------------")
		fmt.Println("------------------------4、退出软件--------------------------")
		fmt.Println("请选择（1-4）:")

		fmt.Scanln(&key)

		switch key {
		case "1":
			fmt.Println("----------------------------当前收支明细记录-----------------------------------")
		case "2":
		case "3":
			fmt.Println("登记支出")
		case "4":
			loop = false
		default:
			fmt.Println("请输入正确的选项")
		}
		if !loop {
			break
		}
	}
	fmt.Println("你退出家庭记账软件的使用...")
}
